Revit 2027 API
FabricationConfiguration.GetAllUsedItemFiles Method
 Returns all the used fabrication item files. A fabrication item file is used if any fabrication parts in the model were created from it.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<FabricationItemFile> GetAllUsedItemFiles()
Public Function GetAllUsedItemFiles As IList(Of FabricationItemFile)
public:
IList<FabricationItemFile^>^ GetAllUsedItemFiles()
member GetAllUsedItemFiles : unit -> IList<FabricationItemFile>
Return Value
IList<FabricationItemFile>
 All the used fabrication item files.
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace